Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཁ་ཅིག་ན་རེ་ངལ་གསོ་བའི་ཕྱིར་བར་བར་ཐུང་ངུ་བྱས། བར་བར་རིང་དུ་བྱས་ཏེ་བསྒོམ་པར་བྱའོ་ཞེས་ཟེར་རོ།
en: Some say to take a rest you should meditate by sometimes shortening it and sometimes lengthening it.

source: །གཞན་དག་ན་རེ་དབུགས་མ་ཐལ་བར་རྔུབ་པ་དང་འབྱུང་བ་ལ་ནི་རིང་པོ་ཞེས་བྱ། སྐབས་སྐབས་སུ་དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་ལ་ནི་ཐུང་ངུ་ཞེས་བྱའོ་ཞེས་ཟེར་རོ།
en: Others say “long” is the ordinary breathing in and out, and “short” is breathing in and out from time to time.

source: །རྫ་མཁན་ནམ་རྫ་མཁན་གྱི་སློབ་མ་ཞེས་བྱ་བ་ལ་རྫ་མཁན་ཞེས་བྱ་བ་ནི་ལེགས་པར་ལོབས་པའོ། །རྫ་མཁན་གྱི་སློབ་མ་ཞེས་བྱ་བ་ནི་སློབ་པ་སྟེ།
en: In “a skillful potter or potter’s apprentice” the “skillful potter” is the one who is well trained and the “potter’s apprentice” the trainee.

source: གཉིས་ཀ་སྨོས་པ་ནི་རྣལ་འབྱོར་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པ་དང་། ལས་དང་པོ་པ་གཉིས་དང་མཐུན་པར་བསྟན་པའོ།
en: It mentions them both to teach that the complete yogic practitioner and the beginner are similar.

source: །ཁམས་ཀྱི་སྒོ་དང་། ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་སྒོ་ནི་གོ་སླའོ།
en: From the viewpoint of constituents and from the viewpoint of the body are easy to understand.

source: །མི་སྡུག་པའི་སྒོ་ལ་ནི་འགྲེས་དགུ་སྟེ། ཤི་ནས་ཞག་གཅིག་ལོན་པ་ནི་རྣམ་པར་བམ་པའོ། །ཤི་ནས་ཞག་གཉིས་ལོན་པ་ནི་རྣམ་པར་བསྔོས་པའོ། །ཤི་ནས་ཞག་གསུམ་ལོན་པའམ། ཤི་ནས་ཞག་བཞི་ལོན་པ་ནི་རྣམ་པར་རྣགས་པའོ། །ཤི་ནས་ཞག་ལྔ་ལོན་པ་ནི་རྣམ་པར་འབུས་གཞིག་པ་སྟེ་འབུ་ཞུགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There are nine sections of the text from the viewpoint of unpleasantness: a body “dead for one day… bloated”; “dead for two days… black and blue”; “dead for three days, or dead for four days… putrid”; “or dead for five days… cleaned out by worms,” which is to say, the worms have gotten into it.

source: །འདས་པའི་དུས་ཐམས་ཅད་ཀྱང་དེ་ལྟ་བུའི་ཆོས་ཅན་ནོ། །མ་འོངས་པ་ཡང་དེ་ལྟ་བུའི་རང་བཞིན་ཅན་ནོ། །ད་ལྟར་བྱུང་བ་ཡང་ཆོས་ཉིད་དེ་ལས་མ་འདས་པའོ།
en: In all the past this “has such a quality”; in the future as well it “is of such a nature”; and in the present it also “does not go beyond having that as its natural state.”

source: །ཟ་བ་ཞེས་བྱ་བའི་འགྲེས་དང་། རྣམ་པར་ཟོས་པ་ཞེས་བྱ་བའི་འགྲེས་གཉིས་ནི་རྣམ་པར་ཟོས་པའི་མི་སྡུག་པ་སྟེ། ད་ལྟར་དང་འདས་པའི་བྱེ་བྲག་གིས་ཕྱེ་བའོ།
en: The two—the “being eaten” section and the “chewed up” section—are the “savaged” unpleasantness divided in terms of the present and past.

source: །ཤ་དང་ཁྲག་ར་རི་ཆགས་པ་རྒྱུས་པས་བྲང་བྲེང་དུ་འབྲེལ་པ་ཞེས་བྱ་བའི་འགྲེས་དང་། གསུམ་ཆར་ཡང་མེད་པའི་འགྲེས་དང་། འགྲེས་དེ་གཉིས་ནི་རྣམ་པར་དམར་བའི་མི་སྡུག་པའོ། །རུས་པ་ཀེང་རུས་ཟུངས་མེད་པ།
en: The two—the “daubed with flesh and blood, and hardly connected by sinews” section, and the section when all the three are no longer there—are the “bloodied” unpleasantness.

source: གྱེས་པ་དུང་གི་མདོག་ལྟར་གྱུར་པ། ས་ལ་རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་འགྲེས་དང་། རྐང་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། བྱིན་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར་ཞེས་བྱ་བའི་འགྲེས་དང་། འགྲེས་དེ་གཉིས་ནི་རྣམ་པར་འཐོར་བའི་མི་སྡུག་པ་སྟེ།
en: The two— “the bones no longer held in the frame of a skeleton, detached from each other, scattered about like conch shells” section, and the “in one the bones of the feet, in another the bones of the lower leg” section—are the “torn asunder” unpleasantness.

source: ཕྱོགས་གཅིག་ཏུ་འཐོར་བ་དང་། ཕྱོགས་ཐམས་ཅད་དུ་འཐོར་བ་ཞེས་བྱ་བ་དེ་ཙམ་གྱིས་དབྱེའོ།
en: The section on being “scattered” in one and in all the directions is just a subdivision of that.

source: །འགྲེས་འོག་མ་གཉིས་ཀྱིས་རུས་གོང་གིས་མི་སྡུག་པ་སྟེ། ཁ་དོག་མ་གྱུར་ཅིང་། རུས་པ་མ་གྲུགས་པ་དང་། ཁ་དོག་གྱུར་ལ་རུས་པ་གྲུགས་པ་ཞེས་བྱ་བ་དེ་ཙམ་གྱིས་དབྱེའོ། །དེ་ལྟར་རྣམ་པར་བམ་པ་དང་། རྣམ་པར་བསྔོས་པ་དང་། རྣམ་པར་རྣགས་པ་དང་།
en: The next two sections are the “bare-bones” unpleasantness—where they are not colored and have not crumbled, and where they are colored and have crumbled, are just divisions of that.

source: རྣམ་པར་འབུས་གཞིག་པ་དང་། རྣམ་པར་ཟོས་པ་དང་། རྣམ་པར་དམར་བ་དང་། རྣམ་པར་འཐོར་བ་དང་། རུས་གོང་ཞེས་བྱ་བ་མི་སྡུག་པ་རྣམ་པ་བརྒྱད་ཡིན་ནོ།
en: Thus, there the unpleasantness is eightfold: bloated, black and blue, putrid, cleaned out by worms, savaged, bloodied, torn asunder, and bare-bones.

source: །རྣམ་པར་འབུས་གཞིག་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་འཚིག་པ་ཞེས་བྱ་བ་ཡང་དེ་ཉིད་དོ།
en: As for the one “cleaned out by worms,” the one that is “burnt” is just that too.

source: །དེ་ལ་ཐམས་ཅད་ཀྱི་དང་པོ་ནི་མི་དམིགས་པར་ཡིད་ལ་བྱེད་པའོ།
en: There, first of all is paying attention without apprehending anything.

source: །རྣམ་པར་ཤེས་པ་དང་བཅས་པའི་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ལྔ་དང་། རྣམ་པར་ཤེས་པ་མེད་པའི་མི་སྡུག་པ་བརྒྱད་དང་། རྣམ་པ་བཅུ་གསུམ་གྱིས་ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་བཤད་དེ། འགྲེས་བཅོ་ལྔ་པའོ།། །།
en: There are five of viewing a body that has consciousness, and eight unpleasantnesses where there is no consciousness, and an explanation of mindfulness of the body in thirteen parts, so the passage has fifteen sections.

source: གཉིས་པ་ལ་ཡང་དག་པར་སྤོང་བ་བཞི་ཞེས་བྱ་བ་ནི་འདིས་སེམས་ཡང་དག་པར་འཇོག་པས་ན་ཡང་དག་པར་འཇོག་པ་ཞེས་བྱ་སྟེ་བརྩོན་འགྲུས་སོ།
en: Great Vehicle of the right abandonments The second is “the four right abandonments.” They are “right efforts,” that is to say, perseverance, because they put the mind to work in the right way.

source: །བརྩོན་འགྲུས་དེ་ཡང་སྦྱོར་བའི་བྱེ་བྲག་གིས་རྣམ་པ་བཞིར་གྱུར་པས་ན་བཞི་ཞེས་བྱའོ།
en: Furthermore, because that perseverance is of four types on account of specific practices, it says “four.”

source: །འདུན་པ་བསྐྱེད་དོ་རྩོལ་ལོ་བརྩོན་འགྲུས་རྩོམ་མོ་སེམས་རབ་ཏུ་འཛིན་ཏོ་ཡང་དག་པར་རབ་ཏུ་འཇོག་གོ་ཞེས་བྱ་བ་ནི།
en: They “generate the desire…, making an effort at it, making a vigorous attempt, tightening up the mind and perfectly settling it down.”

source: བརྩོན་འགྲུས་དེ་ཡང་རྣམ་པ་བཞིར་འགྱུར་ཏེ། གོ་ཆའི་བརྩོན་འགྲུས་དང་། སྦྱོར་བའི་བརྩོན་འགྲུས་དང་། མི་སྐྱེ་བའི་བརྩོན་འགྲུས་དང་། ཐབས་ཀྱི་བརྩོན་འགྲུས་སོ།
en: Perseverance is of four types: armor-perseverance, practice-perseverance, perseverance by not getting depressed, and perseverance through skillful means, so it says “four.”

source: །དང་པོར་འདི་ལྟར་བྱའོ་ཞེས་གོ་ཆ་བགོ་བར་བྱེད་དོ།
en: The first makes them buckle on armor, thinking “I will do it like this.”

source: །དེ་ནི་འདུན་པ་བསྐྱེད་དོ་ཞེས་གསུངས་པའོ།
en: About this, it says “generate the desire.”

source: །དེའི་འོག་ཏུ་གོ་ཆ་བགོས་པ་དང་རྗེས་སུ་མཐུན་པར་སྦྱོར་བ་རྩོམ་སྟེ།
en: Then they exert themselves in practice in line with the armor they have buckled on.

source: དེ་ནི་རྩོལ་ལོ་ཞེས་གསུངས་པའོ།
en: About this, it says “making an effort at it.”

source: །དེའི་འོག་ཏུ་ཚིགས་ཆེ་བར་གྱུར་ཀྱང་སྐྱོ་བ་མ་སྐྱེས་པར་བརྩོན་འགྲུས་ཉིད་འཕེལ་བར་བྱེད་དེ།
en: Then, even if it becomes very difficult, without getting depressed they try even harder.

source: དེ་ནི་བརྩོན་འགྲུས་རྩོམ་མོ་ཞེས་གསུངས་པའོ།
en: About this, it says “making a vigorous attempt.”

source: །དེའི་འོག་ཏུ་ཐབས་མ་ཡིན་པར་བསྒྲུབ་པ་ཡོངས་སུ་སྤངས་ནས་ཡང་དག་པའི་ཐབས་ལ་གནས་པར་བྱེད་དེ།
en: Then they forsake the practice without skillful means and establish themselves in perfect skillful means.

source: དེ་ནི་སེམས་རབ་ཏུ་འཛིན་ནོ། །ཡང་དག་པར་རབ་ཏུ་འཇོག་གོ་ཞེས་བྱ་བ་འདི་གཉིས་ཀྱིས་བསྟན་ཏོ།
en: The two—“tightening up the mind” and “perfectly settling it down”—teach this.

source: །དེ་ལ་སེམས་བྱིང་བར་གྱུར་ན་རབ་ཏུ་འཛིན་པ་ཡིད་ལ་བྱེད་པས་རབ་ཏུ་འཛིན་པས་ན་སེམས་རབ་ཏུ་འཛིན་པ་ཞེས་བྱའོ། །སེམས་རྒོད་པར་གྱུར་ན་མངོན་པར་སྡུད་པ་ཡིད་ལ་བྱེད་པས་ཡང་དག་པར་འཇོག་པ་ལ་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་ཞེས་བྱའོ།
en: When the mind is overly relaxed, they tighten it by paying attention to tightening up, hence it says “tightening up the mind”; and when the mind becomes agitated they perfectly settle it down by paying attention to becoming collected, hence it says “perfectly settling it down.”

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་གྱི་གཞི་དང་།
en: Great Vehicle of the legs of miraculous power The third is “the four legs of miraculous power.”

source: གནས་སུ་གྱུར་པའི་ཕྱིར་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཞེས་བྱ་སྟེ།
en: They are “legs of miraculous power” because they serve as the underpinning and foundation of miraculous powers termed extraordinary dharmas.

source: དེ་དག་ཀྱང་འདུན་པ་དང་། བརྩོན་འགྲུས་དང་། སེམས་དང་། དཔྱོད་པ་དང་བཞིའོ།
en: They are four: “yearning… perseverance, concentrated mind, and examination.”

source: །འདི་ལྟར་ལ་ལ་ནི་དགེ་བའི་ཆོས་སྒོམ་པ་ལ་འདོད་པ་ཆེར་སྐྱེད་པར་གྱུར་པ་ན་དེ་འདུན་པའི་སྟོབས་འབའ་ཞིག་གིས་སྦྱོར་བར་གྱུར་པ། ལེགས་པར་ངེས་པར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་གཞན་མེད་པས་སེམས་རྩེ་གཅིག་ཏུ་འགྱུར་ཏེ།
en: Thus, when certain persons generate a strong desire to cultivate the wholesome dharmas and they have practiced solely on account of the power of the “yearning” to do that, they ponder well, think about and pay attention to nothing else, and their mind becomes single-pointed.

source: དེའི་འདུན་པའི་དབང་གིས་བྱུང་བའི་ཏིང་ངེ་འཛིན་ལ་འདུན་པའི་ཏིང་འཛིན་ཞེས་བྱའོ།
en: That meditative stabilization that is produced, governed by their desire to do it, is called “yearning… meditative stabilization.”

source: །ལ་ལ་ནི་ཡང་དག་པར་སྤོང་བ་བཞིའི་བརྩོན་འགྲུས་ཀྱིས་རབ་ཏུ་སྦྱོར་བ་ན་དགེ་བ་ལ་འཇོག་པའི་བརྩོན་འགྲུས་ཀྱིས་རབ་ཏུ་སྦྱོར་ཞིང་། མི་དགེ་བ་སྤོང་བ་དང་། དགེ་བ་སྐྱེད་པ་ལ་རབ་ཏུ་ཞུགས་པ་ན་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་ཏེ།
en: When certain persons practice with the perseverance of the four right efforts, when they have practiced striving perfectly to eliminate the unwholesome and produce the wholesome, their minds become single-pointed.

source: དེའི་བརྩོན་འགྲུས་ཀྱི་དབང་གིས་བྱུང་བའི་ཏིང་ངེ་འཛིན་ལ་བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: That meditative stabilization that is produced, governed by their perseverance at it, is called “perseverance… meditative stabilization.”

source: །ལ་ལ་ནི་སེམས་སྦྱོང་བ་ལ་ཞུགས་པ་ན་ཞི་གནས་དང་རབ་ཏུ་འཛིན་པ་དང་། བཏང་སྙོམས་ཀྱི་རྒྱུ་མཚན་རྣམས་ཀྱིས་སེམས་ཡང་དག་པར་འཇོག་པ་ལ་སེམས་སྦྱོང་བའི་སྟོབས་ཀྱིས་སེམས་རྩེ་གཅིག་ཏུ་གནས་པར་གྱུར་ཏེ།
en: When certain persons have engaged in training their minds, they cause them to settle down with calm abiding, tightening, and equanimity as the cause, and, through the power of training their minds, their minds abide in single-pointedness.

source: དེའི་སེམས་ཀྱི་དབང་གིས་བྱུང་བའི་ཏིང་ངེ་འཛིན་ལ་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: That meditative stabilization that is produced, governed by the concentrated mind, is called “concentrated mind… meditative stabilization.”

source: །ལ་ལ་ནི་གང་གི་ཚེ་ཡང་དག་པར་སྦྱོར་བ་ན་ཚུལ་བཞིན་མ་ཡིན་པ་སྤང་བ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་། ཀུན་ནས་དཀྲིས་པ་རྣམས་མི་སྐྱེ་བ་དང་། ཀུན་ནས་དཀྲིས་པའི་གཉེན་པོའི་ཆོས་རྣམས་གོམས་པར་བྱས་པས་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཀུན་ཏུ་མི་སྤྱོད་པར་འགྱུར་ཏེ། དེའི་ཚེ་དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: When certain persons practice perfectly and stop what is improper and correctly pay attention, when they are not ensnared and become habituated to things that counteract becoming ensnared so that they do not do the bad unwholesome things they were used to doing, they reflect like this: “Am I not doing the bad things I am used to doing?”

source: །ཅི་བདག་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལ་ཀུན་ཏུ་མི་སྤྱོད་དམ་སྙམ་དུ་སེམས་པ་དེའི་ཚེ་ན་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅི་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཡོད་པ་ལ། བདག་ཀུན་ཏུ་མི་སྤྱོད་པར་གྱུར་ཏམ། འོན་ཏེ་མེད་པ་ཉིད་ལ་ཀུན་ཏུ་མི་སྤྱོད་པར་གྱུར་སྙམ་པ་དེ་བདག་གིས་ཡོངས་སུ་དཔྱད་པར་བྱའོ་སྙམ་ནས་དཔྱོད་པ་ཡིད་ལ་བྱེད་པ་བསྐྱེད་དེ།
en: Even while they are reflecting like that they also think: “I must fully examine whether those bad unwholesome things exist and am I not doing what I am used to doing, or whether they do not exist and I am not doing what I am used to doing.”

source: ཡང་དག་པར་སེམས་པར་འགྱུར་ཏེ།
en: They direct their attention to such an examination and meditate perfectly.

source: དེ་དཔྱོད་པ་ཡིད་ལ་བྱེད་པ་དེའི་དབང་དུ་བྱས་ནས་རྩོལ་བ་ན་ཏིང་ངེ་འཛིན་སྐྱེས་པ་དེ་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: When they exert themselves based on paying attention to the examination of that, the meditative stabilization that arises is called “endowed with an examination… meditative stabilization.”

source: །དེ་ལྟར་ཏིང་ངེ་འཛིན་རྣམ་པ་བཞི་བྱུང་ཞིང་ཀུན་ནས་དཀྲིས་པ་ཐག་རིང་དུ་གྱུར་ནས་བག་ལ་ཉལ་བ་རྣམས་སྤང་བའི་ཕྱིར་གོང་དུ་ཡང་དག་པའི་སྤོང་བ་བཞི་པོ་དག་གིས་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: After the four meditative stabilizations have come about and the snares are distant, they make a further vigorous attempt to eliminate the residual impressions with the above four right efforts.

source: དེ་བརྩོན་འགྲུས་རྩོམ་པ་ན་སྤོང་བའི་འདུ་བྱེད་ཀྱི་ཆོས་བརྒྱད་མངོན་དུ་འགྱུར་ཏེ། ནམ་ཞིག་ན་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་སྙོམས་པར་འཇུག་པ་བསྐྱེད་པར་བྱ་སྙམ་དུ་སེམས་པའི་འདུན་པ་དང་།
en: When they make the vigorous attempt, the eight dharmas of the “volitional effort to eliminate” arise.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ངེས་པར་འཇོམས་པའི་བརྩོན་འགྲུས་དང་། གོང་དུ་ཐོབ་པའི་ཆོས་ལ་དད་པ་དང་། དེ་སྔོན་དུ་བཏང་བའི་ཤིན་ཏུ་སྦྱངས་པ་དང་། དེ་ལ་དྲན་པ་དང་ཤེས་བཞིན་གྱི་ཕྱོགས་དང་། ལྷག་མཐོང་གི་ཕྱོགས་ཀྱི་ཤེས་བཞིན་དང་། དེ་ལ་སེམས་མངོན་པར་འདུ་བྱེད་པའི་སེམས་དང་། སེམས་ཀུན་ནས་ཉམས་པ་མེད་པའི་བདག་ཉིད་ཀྱི་བཏང་སྙོམས་རྣམས་ཏེ་སྔར་སྨོས་པའི་འདུན་པའི་ཏིང་ངེ་འཛིན་དང་། འདུན་པ་དང་། བརྩོན་འགྲུས་དང་། དད་པ་དང་།
en: These are the yearning intention to generate the ordinary and extraordinary absorptions, the resolve to overcome all unwholesome dharmas, the faith in qualities attained at higher stages, the pliancy when that has gone before, the mindfulness and introspection factors in that, the introspection on the insight side, the mind that is actively concerned with that, and the relaxation when there is no degeneration of the mind.

source: ཤིན་ཏུ་སྦྱངས་པ་དང་། དྲན་པ་དང་། ཤེས་བཞིན་དང་། སེམས་པ་དང་། བཏང་སྙོམས་ཞེས་བྱ་བ་སྤོང་བའི་འདུ་བྱེད་བརྒྱད་པོ་འདི་དག་དང་ལྡན་པར་འཇིག་རྟེན་ལས་འདས་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པར་འགྱུར་བའི་ཏིང་ངེ་འཛིན་སྒོམ་མོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they “develop” the meditative stabilization that is a “limb of” extraordinary “miraculous power endowed with” the aforementioned “yearning… meditative stabilization” and the eight dharmas of the “volitional effort to eliminate”— yearning, perseverance, faith, pliancy, mindfulness, introspection, intention, and equanimity. “

source: །དབེན་པ་ལ་གནས་པ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་དག་ལས་དབེན་པའོ། །སྲིད་པ་ལས་འདོད་ཆགས་དང་བྲལ་བའོ། །སྡུག་བསྔལ་འགོག་པའོ། །ཕུང་པོ་ཐམས་ཅད་རྣམ་པར་སྤོང་བའོ།
en: Based on isolation”— “isolation” is from defilements; “detachment” is from suffering existence; “cessation” is of suffering; and “renunciation” is of all the aggregates.

source: །ཡང་ན་སྡུག་བསྔལ་གྱི་བདེན་པ་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་དབེན་པ་ལ་གནས་པའོ། །ཀུན་འབྱུང་བའི་བདེན་པ་སྤང་བའི་ཕྱིར། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པའོ། །འགོག་པའི་བདེན་པ་མངོན་སུམ་དུ་བྱས་པའི་ཕྱིར། འགོག་པ་ལ་གནས་པའོ། །ལམ་གྱི་བདེན་པ་བསྒོམ་པའི་ཕྱིར།
en: Alternatively, “based on isolation” is because of comprehending the truth of suffering; “based on detachment” is because of eliminating the truth of origination; “based on cessation” is because of making the truth of cessation directly known; and “transformed by renunciation” is because of meditation on the truth of the path.

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་ཞེས་སྦྱར་བར་བྱའོ། །ཡང་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོས་ནི་དབེན་པ་ལ་གནས་པའོ། །ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོས་ནི་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པའོ། །ཤེས་རབ་ཀྱི་ཕུང་པོས་འགོག་པ་ལ་གནས་པའོ།
en: Alternatively, it is on account of the aggregate of morality that it is “based on isolation,” on account of the aggregate of meditative stabilization “based on detachment,” on account of the aggregate of wisdom “based on cessation,” and on account of the aggregate of liberation “transformed by renunciation.”

source: །བཞི་པ་ལ་ནི་དེ་ལྟར་བདག་པོ་བཞི་པོ་དག་གིས་ཡང་དག་པར་སྦྱོར་བ་ཁྱད་པར་གྱི་ཆོས་འབྱུང་བའི་རྟགས་མཐོང་བས་གོང་དུ་ཁྱད་པར་གྱི་ཆོས་འབྱུང་བ་ལ་ངེས་པ་སྐྱེ་སྟེ། དེའི་ཚེ་རྣལ་འབྱོར་པ་དེ་སྟོན་པ་དང་། ཉན་ཐོས་རྣམས་ཀྱི་ཐོབ་པ་ལ་ཡིད་ཆེས་པ་སྐྱེའོ།
en: Great Vehicle of the faculties As for the fourth, when the practitioners of the preparation for reality governed by all four such conditions see the sign that a special dharma is going to emerge, the certainty that the special dharma will emerge arises, and at that time a confidence about what the Teacher and the śrāvakas have attained arises.

source: །དེ་དེ་ལྟར་ཡིད་ཆེས་པ་ན་གོང་དུ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་འབྱུང་བ་ལ་དབང་བྱེད་པས་དད་པའི་དབང་པོ་ཞེས་བྱའོ།
en: When they have such confidence, it is called the “faith faculty,” because it is a faculty in charge of the emergence of the transcendental extraordinary dharma at the higher stage.

source: །དད་པའི་སྟོབས་ཀྱིས་ཀྱང་བརྩོན་འགྲུས་ཤིན་ཏུ་ལྷག་པར་སྐྱེ་སྟེ།
en: On account of the power of the faith a surpassing perseverance arises.

source: དེ་ཡང་དེ་བཞིན་དུ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་འབྱུང་བ་ལ་དབང་བྱེད་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཞེས་བྱའོ།
en: It too is similarly called the “perseverance faculty,” because it is a faculty in charge of the emergence of the transcendental extraordinary dharma.

source: །དྲན་པ་ལ་སོགས་པ་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་བར་བྱའོ།
en: Connect this in the same way with the “mindfulness faculty,” and so on, as well. 8.

source: །ལྔ་པ་ལ་ནི་དེ་ལྟར་དད་པ་དེ་ཉིད་མངོན་པར་འཕེལ་བས་ལྷའམ་བདུད་དམ། ཚངས་པ་ཡང་རུང་། གང་གིས་ཀྱང་ཆོས་དང་མཐུན་པས་ཐུབ་པར་མ་ནུས་ཤིང་ཉོན་མོངས་པ་ཀུན་ནས་དཀྲིས་པས་ཀྱང་མི་ཚུགས་པར་གྱུར་པ་དེའི་ཚེ་དེ་ཉིད་ལ་དད་པའི་སྟོབས་ཞེས་བྱའོ།
en: Great Vehicle of the powers As for the fifth, when their faith itself gets stronger and no one at all, be it the gods, Māra, or Brahmā, can withstand it, whatever their qualities, and they are not trapped in the snares of the defilements, it is called the “faith power.”

source: །གོང་དུ་སྨོས་པ་དེ་དག་ཉིད་ཀྱིས་མི་བརྫི་བའི་ཕྱིར་དེ་བཞིན་དུ་བརྩོན་འགྲུས་ལ་སོགས་པ་ཡང་ཐུབ་དཀའ་བར་འགྱུར་རོ།
en: Just because it is not overwhelmed for the same reasons just explained, “perseverance” and so on become hard to withstand.

source: །སྟོབས་དེ་དག་གིས་རྣལ་འབྱོར་པ་དེ་སྟོབས་དང་ལྡན་པས་བདུད་ཀྱི་སྟོབས་ཐམས་ཅད་ལས་རྒྱལ་ནས་རབ་ཏུ་སྦྱོར་ཏེ།
en: The practitioners with those powers are powerful, so having overcome all the powers of Māra they are really prepared.

source: དེ་བས་ན་སྟོབས་རྣམས་ཞེས་བྱའོ།
en: Therefore, they are called powers.

source: །དད་པའི་དབང་པོ་ལ་སོགས་པ་ལྔ་པོ་དེ་དག་ཉིད་བསྒོམས་ན་ངེས་པར་འབྱེད་པའི་ཆ་དང་མཐུན་པའི་དགེ་བའི་རྩ་བ་བཞིར་འགྱུར་ཏེ། དྲོ་བར་གྱུར་པ་དང་། རྩེ་མོ་དང་། བཟོད་པ་དང་། འཇིག་རྟེན་པའི་ཆོས་ཀྱི་མཆོག་གོ།
en: When those five faith faculties and so on have been developed they become the wholesome roots that are aids to knowledge that penetrates true reality: the warmed, the peaked, the forbearance, and the highest ordinary dharma.

source: །དེ་ལ་དྲོ་བར་གྱུར་པ་དང་། རྩེ་མོའི་གནས་སྐབས་ན་ནི་དབང་པོ་ཞེས་བྱའོ། །བཟོད་པ་དང་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་མཆོག་གི་གནས་སྐབས་ན་ནི་སྟོབས་རྣམས་ཞེས་བྱའོ།
en: During the period of the warmed and peaked they are called faculties; during the forbearance and highest ordinary dharma periods they are called powers.

source: །དེ་ལ་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་མཆོག་ཅེས་བྱ་བའི་ལྔ་པོ་རྣམས་ཤིན་ཏུ་ཡོངས་སུ་འཕེལ་ན་དེ་མ་ཐག་ཏུ་མཐོང་བའི་ལམ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རྟོགས་པའི་ཡན་ལག་ཏུ་འགྱུར་བས།
en: 9. Great Vehicle of the limbs of awakening There, immediately after “the highest ordinary dharma,” when all five have become extremely strong they become branches of the path of seeing, the correct realization of reality.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱ་བའི་ཆོས་བདུན་འབྱུང་སྟེ།
en: Thus “the seven” dharmas that are “limbs of awakening” arise.

source: ཆོས་རྣམ་པར་འབྱེད་པ་དང་བརྩོན་འགྲུས་དང་། དགའ་བ་ཞེས་བྱ་བ་འདི་གསུམ་ནི་ལྷག་མཐོང་གི་ཕྱོགས་སོ། །ཤིན་ཏུ་སྦྱངས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། བཏང་སྙོམས་ནི་ཞི་གནས་ཀྱི་ཕྱོགས་སོ།
en: The three, “examination of dharmas, perseverance, and joy,” are the insight factors; “pliability, meditative stabilization, and equanimity” are the calm abiding factors; and “mindfulness” is on both sides.

source: །དེས་ཀྱང་དེ་དག་ཐོབ་པས་བདག་གི་ཉོན་མོངས་པ་མཐོང་བས་སྤང་བར་བྱ་བ་རྣམས་ནི་སྤངས་པར་མཐོང་ཞིང་།
en: Great Vehicle of the path There they see that by attaining those [seven limbs], of their afflictions, the ones eliminated by seeing have been eliminated but the ones eliminated by meditation have not been eliminated.

source: བསྒོམས་པས་སྤང་བར་བྱ་བ་རྣམས་ནི་མ་སྤངས་པར་མཐོང་ནས་དེ་དག་སྤང་བའི་ཕྱིར། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཕུང་པོ་གསུམ་བསྒོམ་མོ། །དེ་ལ་ཡང་དག་པའི་ལྟ་བ་དང་།
en: So, to eliminate them they meditate on the noble path that is eightfold, and in the three aggregates.

source: ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་རྩོལ་བ་རྣམས་ནི་ཤེས་རབ་ཀྱི་ཕུང་པོའོ། །ཡང་དག་པའི་ངག་དང་། ལས་ཀྱི་མཐའ་དང་། འཚོ་བ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོའོ།
en: There, “right view, right idea,and right effort” are the aggregate of wisdom; “right speech, right conduct, and right livelihood” of morality; and the two, “right mindfulness and right meditative stabilization,” of meditative stabilization.

source: །ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གཉིས་ནི་ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོའོ། །ཡན་ལག་བརྒྱད་ཀྱིས་བསྡུས་པའི་ལམ་དེ་ཡང་འཕགས་པ་སློབ་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ་དང་། རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱ་བའི་ལམ་ཡིན་པའི་ཕྱིར། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཞེས་བྱ་སྟེ།
en: Because that path systematized as eightfold, furthermore, has eliminated all the defilements of noble trainees, and is the path that witnesses freedom directly, it is called “the eightfold noble path.”

source: དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་ཐེག་པ་ཆེན་པོ་བསྟན་པ་ཡིན་ནོ།
en: Those are teaching the Great Vehicle of the dharmas on the side of awakening. 11.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟར་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱི་ཏིང་ངེ་འཛིན་གསུམ་སྟེ།
en: Great Vehicle of the liberations “Furthermore, Subhūti, the Great Vehicle of bodhisattva great beings is this: the three meditative stabilizations that are the three gateways to liberation. What are the three?

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་།
en: They are the emptiness meditative stabilization, the signless meditative stabilization, and the wishless meditative stabilization.”

source: སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ་ཞེས་བྱ་བ་ནི་དེ་ལ་བྱིས་པའི་སྤྱོད་ཡུལ་ཀུན་བརྟགས་པའི་མཚན་ཉིད་གང་ཡིན་པའི་མཚན་ཉིད་དེ་དང་བྲལ་བ་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་བརྗོད་དུ་མེད་ཅིང་། སྟོང་པའི་རྣམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བའི་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཏོ།
en: Among them, the single-pointed mind that sees, as an image of the empty, the inexpressible marked as the thoroughly established phenomenon, which is separated from the marks of the objective range of foolish beings marked as falsely imagined, is the emptiness meditative stabilization.

source: །ཡོངས་སུ་གྲུབ་པའི་དངོས་པོ་གང་ཡིན་པ་དེ་ཉིད་ཡོངས་སུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པའི་སྤྲོས་པ་ཐམས་ཅད་ཀྱི་མཚན་མའི་རྣམ་པ་དང་བྲལ་བ་ནམ་མཁའ་བཞིན་དུ་མཚན་མ་མེད་པའི་རྣམ་པར་ཞི་བ་ཉིད་དུ་ཡིད་ལ་བྱེད་པའི་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: That attention, in the form of a single-pointed mind, to calmness in the image of a spacelike signlessness, which is a separation from the representation of the true reality that is a thoroughly established functioning thing, an image of a sign that causes all conceptual thought construction, is the signlessness meditative stabilization.

source: །ཡང་གཞན་གྱི་དབང་གིས་ཡོངས་སུ་གྲུབ་པའི་དངོས་པོ་དེ་ཉིད་བཟུང་ནས། དེ་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་དངོས་པོ་ལ་གཞན་གྱི་དབང་གིས་ཡོངས་སུ་རྟོག་པའི་སྤྲོས་པ་ལས་བྱུང་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཉེ་བར་ཉོན་མོངས་པ་ནི་སྨད་པ་ཡིན་ནོ་སྙམ་ནས་དེ་ལ་མི་མཐུན་པར་འདུ་ཤེས་ཏེ། ཕྱིན་ཆད་ཁམས་གསུམ་པ་དེ་ལ་མི་སྨོན་ཅིང་གནས་པར་མི་བྱའོ་སྙམ་དུ་བསམས་ནས། དེ་ལྟར་ཡིད་ལ་བྱེད་པའི་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: Also, having grasped true reality—the functioning thing thoroughly established on account of an other-powered phenomenon—and having thought about such an extremely purified functioning thing, that “the affliction of it with the afflictive emotions that arise from a representation of thought construction on account of an other-powered phenomenon would be disgrace”; and having then perceived it as discordant and thought, “From now on may I not wish for and remain in those three realms”—such an attention, in the form of a single-pointed mind, is the wishlessness meditative stabilization.
